           IDENTIFICATION DIVISION.
           PROGRAM-ID. PROGCOB01.
      ******************************
      ******** COMENTARIOS  - REMARKS
      *    AUTOHOR= KAROLINE
      *     MOSTRAR STRING HELLO
      *    DATA= 25/08/21
      ******************************
           ENVIRONMENT DIVISION.

           DATA DIVISION.
           PROCEDURE DIVISION.
               DISPLAY 'HELLO WORD'.
               STOP RUN.
